# GetLayerTableIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerTable..::..GetLayerTableIterator Method
ExportLayerTable Class See Also
---
Returns a LayerTableIterator that iterates through the collection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ExportLayerTableIterator GetLayerTableIterator()
```

Visual Basic
---
```text
Public Function GetLayerTableIterator As ExportLayerTableIterator
```

Visual C++
---
```text
public:
ExportLayerTableIterator^ GetLayerTableIterator()
```

# ### Return Value
A LayerTableIterator object that can be used to iterate through key-value pairs in the collection.
# See Also
ExportLayerTable Class
Autodesk.Revit.DB Namespace